#  Grouping Rows by Values

In [1]:
import pandas as pd

url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

df = pd.read_csv(url)
df.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [6]:
df.groupby('PClass').mean()

              Age  Survived   SexCode
PClass
*             NaN  0.000000  0.000000
1st     39.667788  0.599379  0.444099
2nd     28.300142  0.426523  0.383513
3rd     25.208585  0.194093  0.298172

In [11]:
df.groupby(["PClass","Sex"])["Survived"].mean()

PClass  Sex
*       male      0.000000
1st     female    0.937063
        male      0.329609
2nd     female    0.878505
        male      0.145349
3rd     female    0.377358
        male      0.116232
Name: Survived, dtype: float64

In [12]:
df.groupby(["PClass","Sex"]).mean()

                     Age  Survived  SexCode
PClass Sex
*      male          NaN  0.000000      0.0
1st    female  37.772277  0.937063      1.0
       male    41.199360  0.329609      0.0
2nd    female  27.388235  0.878505      1.0
       male    28.910472  0.145349      0.0
3rd    female  22.776176  0.377358      1.0
       male    26.357222  0.116232      0.0

### Users new to groupby often write a line like this and are confused by what is returned:
### Group rows
> dataframe.groupby('Sex')

> <pandas.core.groupby.DataFrameGroupBy object at 0x10efacf28>
### Why didnâ€™t it return something more useful? The reason is because groupby needs to be paired with some operation we want to apply to each group, such as calculating an aggregate statistic (e.g., mean, median, sum).